<?php
/******************************************************************************\
    ______  _                                    ____ _____  _  ____  ______
    | ___ \| |                                  / _  | ___ \| |/ __ \/ ____/
    | |  \ \ |          Dmitry Lebedev         / /_| | |  \ \ | /  \ \____ \
    | |__/ / |____      <dl@adios.ru>         / ___  | |__/ / | \__/ /___/ /
    |_____/|_____/                           /_/   |_|_____/|_|\____/_____/

    ------------------------------------------------------------------------

    enum dl\IOCode

    ------------------------------------------------------------------------

    PHP 8.1                                                         (C) 2021

\******************************************************************************/
declare(strict_types=1);
namespace dl;

enum IOCode: int implements ErrorCodifier {
	// VALUE RANGE 50 - 99
	case Filename = 50; // Неверное имя файла
	case Makedir  = 51; // Ошибка при создании директории
	case Makefile = 52; // Ошибка при создании файла
	case Copy     = 53; // Ошибка при копировании файла
	case Rename   = 54; // Ошибка при переименовании файла
	case Nodir    = 55; // Директория не существует
	case Nofile   = 56; // Файл не существует
	case Rmdir    = 57; // Не удалось удалить директорию
	case Unlink   = 58; // Не удалось удалить файл
	case Chmod    = 59; // Ошибка при изменении режима доступа к папкам и файлам

	public function isFatal(): bool {
		return false;
	}
}