<?php
/******************************************************************************\
    ______  _                                    ____ _____  _  ____  ______
    | ___ \| |                                  / _  | ___ \| |/ __ \/ ____/
    | |  \ \ |          Dmitry Lebedev         / /_| | |  \ \ | /  \ \____ \
    | |__/ / |____      <dl@adios.ru>         / ___  | |__/ / | \__/ /___/ /
    |_____/|_____/                           /_/   |_|_____/|_|\____/_____/

    ------------------------------------------------------------------------

    enum dl\Mode
	Преречисление наиболее общих режимов работы для всех библиотек и
	приложений.	Рекомендуется использовать, если приложения не имеют
	своей собственной системы классификации режимов работы.
	Поддерживает интерфейс выбора предпочитаемого (текущего) режима
	\dl\PreferredCase.

    ------------------------------------------------------------------------

    PHP 8.1                                                         (C) 2021

\******************************************************************************/
declare(strict_types=1);
namespace dl;

enum Mode implements PreferredCase {
	use CurrentCase;

	case Product;
	case Develop;
	case Test;
	case Error;

	public static function byDefault(): self {
		return self::Product;
	}
}
