<?php
/******************************************************************************\
    ______  _                                    ____ _____  _  ____  ______
    | ___ \| |                                  / _  | ___ \| |/ __ \/ ____/
    | |  \ \ |          Dmitry Lebedev         / /_| | |  \ \ | /  \ \____ \
    | |__/ / |____      <dl@adios.ru>         / ___  | |__/ / | \__/ /___/ /
    |_____/|_____/                           /_/   |_|_____/|_|\____/_____/

    ------------------------------------------------------------------------

    final class dl\ru\Core

    ------------------------------------------------------------------------

    PHP 8.1                                                         (C) 2021

\******************************************************************************/
declare(strict_types=1);
namespace dl\ru;

final class Core extends \dl\Getter {
	protected function initialize(): void {
		$this->_property['success']    = 'Все в порядке.';

		$this->_property['e_ext']      =
		'Для работы программы требуется расширение "{0}".';

		$this->_property['e_class']    =
		'Подключенный файл "{0}" вернул объект класса "{1}". '.
		'Ожидался объект класса "{2}".';

		$this->_property['e_type']     =
		'Подключенный файл "{0}" вернул неверный тип данных "{1}". '.
		'Ожидался объект.';

		$this->_property['e_load']     =
		'Интерфейс (класс, трейт) "{0}" не был найден в процессе загрузки.';

		$this->_property['h_registry'] =
		'Полный реестр классов и интерфейсов.';

		$this->_property['e_ftok']     =
		'Не удается преобразовать путь "{0}" и идентификатор проекта "{1}" '.
		'в ключ System V IPC.';

		$this->_property['w_trace']    = 'Трассировка';
		$this->_property['w_file']     = 'Файл';
		$this->_property['w_line']     = 'Строка';
		$this->_property['w_context']  = 'Контекст';
		$this->_property['w_invoker']  = 'Вызвавший';

		$this->_property['src_header'] = \dl\Core::getHeader();
	}
}
